cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'


# Install ZSH
# Make sure /usr/bin/env/zsh is appended to /etc/shells (this is done in install.sh)
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'
brew 'bash-completion@2'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Useful Binaries
brew 'awscli'
brew 'ack'
brew 'dockutil'
# brew 'gh'
brew 'git' #look at atlassian setup guide to remove outdated version of git
brew 'git-lfs'
# brew 'heroku/brew/heroku'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'openssl'
brew 'rlwrap'
brew 'tree'
brew 'unar'
brew 'wget'
brew 'wifi-password'

# Development
brew 'the_silver_searcher'
brew 'tmux'
brew 'neovim'

# GUI Apps
cask 'docker'
cask 'firefox@developer-edition'
cask 'github'
cask 'hyper'
cask 'imageoptim'
cask 'iterm2'
cask 'kap'
cask 'postman'
cask 'raycast'
cask 'zed'

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
# brew install qlcolorcode qlstephen qlmarkdown quicklook-json qlimagesize suspicious-package apparency quicklookase qlvideo
cask 'quicklook-csv'
cask 'qlprettypatch'
cask 'betterzip'
cask 'qlzipinfo'
cask 'webpquicklook'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store Apps
mas "Microsoft Remote Desktop", id: 1295203466
